const qnaList = [
  {
    q: "1. 주말에는 주로 어떤 걸 하시나요?",
    a: [
      { answer: "a. 주로 밖에 나가서 기분 전환을 한다", type: [2] },
      { answer: "b. 나만의 시간을 가지며 충전한다", type: [1] },
    ],
  },
  {
    q: "2. 친구들은 보통 어떻게 만나나요?",
    a: [
      { answer: "a. 보통 친구들이 부르면 나가는 스타일", type: [1, 8] },
      { answer: "b. 내가 약속을 먼저 잡는 스타일", type: [2, 7] },
    ],
  },
  {
    q: "3. 애인한테는 어떤 사람이 되려고 하나요?",
    a: [
      { answer: "a. 함께 있으면 웃음을 주는 사람", type: [4, 6] },
      { answer: "b. 낮이나 밤이나 듬직한 사람", type: [3, 5] },
    ],
  },
  {
    q: "4. 보통 데이트 코스는 어떻게 짜나요?",
    a: [
      {
        answer: "a. 그런 건 좀 약한데 얼마든 맞춰서 다녀줄 수 있다", type: [8] },
      { answer: "b. 나는 계획을 엄청 센스있게 잘 세울 수 있다", type: [7] },
    ],
  },
  {
    q: "5. 맛집 찾아서 엄청 오랫동안 줄 기다리는 건 어떤가요?",
    a: [
      {
        answer: "a. 가자면 가겠지만 사실 왜 그렇게까지 먹는지는 모르겠다", type: [1, 3, 5] },
      { answer: "b. 맛집이라면 완전 오케이! 먹는 걸 좋아한다", type: [2, 4, 6] },
    ],
  },
  {
    q: "6. 만약에 상대방과 이야기를 하다 말도 안되는 주장을 계속 한다면?",
    a: [
      { answer: "a. 귀여우니까 봐준다", type: [4, 6, 8] },
      { answer: "b. 아닌 건 아니라고 말한다", type: [3, 5, 7] },
    ],
  },
  {
    q: "7. 화나면 어떻게 되나요?",
    a: [
      { answer: "a. 팩트로 마구 때려주는 타입", type: [5] },
      { answer: "b. 화나서 바들바들 떨리는 타입", type: [6] },
    ],
  },
  {
    q: "8. 만약 상대방과 싸우면 어떻게 할 것인가요?",
    a: [
      { answer: "a. 나는 우리가 왜 싸웠는지를 아는 게 중요하다", type: [5] },
      { answer: "b. 나는 서로의 감정을 솔직하게 털어놓는 게 중요하다", type: [6] },
    ],
  },
  {
    q: "9. 기념일 때 선물 같은 건 어떻게 챙기나요?",
    a: [
      { answer: "a. 그 날의 감에 맡기는 편이다", type: [8] },
      { answer: "b. 미리 상대가 좋아할 만한 걸 생각해두는 편이다", type: [7] },
    ],
  },
  {
    q: "10. 상대가 당신에게 어떻게 접근할 때 더 설레나요?",
    a: [
      { answer: "a. 부끄러운 얼굴로 호감을 표현할 때", type: [2] },
      { answer: "b. 적극적으로 들이댈 때", type: [1] },
    ],
  },
  {
    q: "11. 연애에 있어서 밀당이 필요하다고 생각하나요?",
    a: [
      { answer: "a. 네", type: [2] },
      { answer: "b. 아니오", type: [1] },
    ],
  },
  {
    q: "12. 당신은 상대의 어떤 모습에 반하나요?",
    a: [
      { answer: "a. 나와 지향하는 미래가 비슷할 때", type: [4] },
      {
        answer: "b. 쇼핑이나 음식같이 소소한 부분에서 나와 취향이 잘 맞을 때", type: [3] },
    ],
  },
  {
    q: "13. 당신이 연애를 결정하는 기준은 무엇인가요?",
    a: [
      { answer: "a. 꿈꿔왔던 이상형과 얼마나 가까운지가 중요하다", type: [4, 8] },
      { answer: "b. 감정적으로 끌리는지가 중요하다", type: [3, 8] },
    ],
  },
];

